{
  "backend/main.mo": "Main actor implementing marketplace backend with user profiles, products, cart, orders, and reviews functionality, including role-based access control (buyer/seller) and blob storage integration.",
  "backend/migration.mo": "Migration module defining OldActor and NewActor types with a run function that adds an empty reviews list to the existing actor state.",
  "feature_evidence.json": "Feature evidence report documenting five implemented review and rating features with high confidence, including display, submission, React Query hooks, and UI components.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing components, pages, hooks, and styling for the marketplace application with warm earth tone design system.",
  "frontend/index.css": "Global CSS with Tailwind layers defining warm earth tone color variables in OKLCH format for light and dark modes, including sidebar, chart, and UI component tokens.",
  "frontend/index.html": "HTML entry point with viewport meta tag, 'Marketplace Hub' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (catalog, product detail, seller/buyer dashboards, cart, checkout, orders), profile setup modal, theme provider, and toaster.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component handling Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog for new users to set up their profile by entering their name and selecting a role (buyer or seller). Uses a form with validation and mutation hook to save the profile.",
  "frontend/src/components/cart/CartItemRow.tsx": "Displays a single cart item with product image, details, quantity controls, and remove button. Handles quantity updates and item removal with mutation hooks.",
  "frontend/src/components/cart/CartSummary.tsx": "Shows order summary card with item count, total price calculation, and a checkout button. Sticky positioned for easy access during cart review.",
  "frontend/src/components/checkout/OrderSummary.tsx": "Displays checkout order summary with list of cart items, quantities, individual prices, and total amount. Read-only view for order confirmation.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header navigation, authentication state, role-based menu items, cart badge, and footer. Wraps all pages with consistent structure.",
  "frontend/src/components/orders/OrderCard.tsx": "Displays order details including order ID, status badge, buyer info (for sellers), item list with quantities and prices, and total amount.",
  "frontend/src/components/products/ProductCard.tsx": "Product card component showing image, name, description, category badge, average rating, price, and seller name. Links to product detail page with hover effects.",
  "frontend/src/components/products/ProductFilters.tsx": "Filter controls for product listing with search input and category dropdown selector. Manages search term and category selection state.",
  "frontend/src/components/products/ReviewForm.tsx": "Form for submitting product reviews with star rating input, comment textarea with character limit, and validation. Uses mutation hook to submit reviews.",
  "frontend/src/components/reviews/StarRating.tsx": "A read-only star rating display component that renders filled/partial stars based on a numeric rating value, with configurable size and optional numeric display.",
  "frontend/src/components/reviews/StarRatingInput.tsx": "An interactive star rating input component with hover effects and keyboard navigation, allowing users to select a rating by clicking or using keyboard controls.",
  "frontend/src/components/seller/AddProductForm.tsx": "A form component for sellers to add new products with fields for name, description, price, category, and image upload with progress tracking.",
  "frontend/src/components/seller/EditProductModal.tsx": "A modal dialog component for editing existing product details including name, description, price, category, and image with upload progress tracking.",
  "frontend/src/components/seller/ProductManagementList.tsx": "Displays a grid of seller's products with edit and delete actions, including loading states, empty states, and confirmation dialogs for deletion.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing AuthClient creation and identity state with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, products, cart management, orders, and reviews. Each hook wraps actor calls with proper loading states, caching, and query invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light and dark themes using warm earth tones (terracotta, sage green, warm cream). Defines CSS variables for colors, spacing, and component styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/BuyerOrders.tsx": "Displays a buyer's order history with authentication checks and role validation. Shows order cards or an empty state if no orders exist.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page that displays cart items with product details and a summary sidebar. Shows empty state when cart is empty and requires authentication.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that displays order summary and handles purchase completion. Validates authentication and non-empty cart before allowing checkout.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page shown after successful checkout with success message and navigation buttons to view orders or continue shopping.",
  "frontend/src/pages/ProductCatalog.tsx": "Main product listing page with hero banner, search, and category filtering. Displays products in a responsive grid with loading skeletons.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page showing product information, seller profile, reviews with ratings, and add-to-cart functionality. Includes review form for buyers who have purchased the product.",
  "frontend/src/pages/SellerDashboard.tsx": "Seller dashboard page with authentication checks, displaying tabs for managing existing products and adding new products via ProductManagementList and AddProductForm components.",
  "frontend/src/pages/SellerOrders.tsx": "Seller orders page showing sales orders containing the seller's products, with authentication checks and OrderCard components for each order.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme with custom fonts (Inter, Poppins), animations, and plugins for typography and container queries.",
  "project_state.json": "Project metadata defining an e-commerce marketplace with multi-user roles (sellers/buyers), listing existing features including user auth, product management, shopping cart, checkout, and order management systems."
}